/**
 * 全局环境优先使用const
 * let代替var
 * 静态字符串使用单引号，动态字符串使用反引号
 * 数组成员赋值，参数对象，函数返回多个值优先使用解构赋值
 * 单行对象结尾成员不已逗号结尾，多行反之
 * 定义的对象不得随意添加新属性（assign添加）
 * 对象属性方法用简洁方式
 * 对象属性动态时使用属性表达式定义
 * 使用扩展运算符进行数组拷贝
 * 使用Array.from()转换类数组
 * 匿名函数使用箭头函数
 * 使用函数表达式时用箭头函数
 * 简单的、单行的、不会复用的函数，建议采用箭头函数
 * 不在函数体内使用arguments而用扩展运算符
 * 使用默认值语法设置参数默认值
 * 如果只需要key：value的数据机构使用map
 * 总使用class
 * 使用extends继承
 * 使用import取代require
 * 使用export取代module.exports
 * 模块多个输出值用普通，单个用export default，不能同时用
 * 不在模块中使用通配符
 * 默认输出对象首字母大写，如果是函数则小写
 * 
 */